[
    {
        "id": 1,
        "name": "ASUS Dual NVIDIA GeForce RTX 3050 6GB OC Edition Gaming Graphics Card - PCIe 4.0, 6GB GDDR6 Memory, HDMI 2.1, DisplayPort 1.4a, 2-Slot Design, Axial-tech Fan Design, 0dB Technology, Steel Bracket",
        "title": "ASUS Dual NVIDIA GeForce RTX 3050 6GB",
        "brand": "ASUS",
        "price": 100.32,
        "imageUrl": "http://localhost:3000/images/1.jpg",
        "category": "GPU",
        "descriptions": [
            "NVIDIA Ampere Streaming Multiprocessors: The all-new Ampere SM brings 2X the FP32 throughput and improved power efficiency.",
            "2nd Generation RT Cores: Experience 2X the throughput of 1st gen RT Cores, plus concurrent RT and shading for a whole new level of ray-tracing performance.",
            "3rd Generation Tensor Cores: Get up to 2X the throughput with structural sparsity and advanced AI algorithms such as DLSS. These cores deliver a massive boost in game performance and all-new AI capabilities.",
            "Axial-tech fan design features a smaller fan hub that facilitates longer blades and a barrier ring that increases downward air pressure.",
            "A 2-slot Design maximizes compatibility and cooling efficiency for superior performance in small chassis."
        ],
        "rating": 4,
        "merchant": "Bob's Code Cave",
        "available": 5
    },
    {
        "id": 2,
        "name": "CORSAIR VENGEANCE RGB DDR5 RAM 32GB (2x16GB) 6400MHz CL36-48-48-104 1.35V Intel XMP Desktop Computer Memory - Black (CMH32GX5M2B6400C36)",
        "title": "CORSAIR VENGEANCE RGB DDR5 RAM 32GB",
        "brand": "CORSAIR",
        "price": 45.23,
        "imageUrl": "http://localhost:3000/images/2.jpg",
        "category": "RAM",
        "descriptions": [
            "VENGEANCE RGB DDR5 memory is designed for high-performance overclocking on the latest Intel and AMD DDR5 motherboards.",
            "Supports Intel XMP 3.0 for easy overclocking and customization.",
            "Custom performance PCB for superior signal quality and stability.",
            "Aluminum heat spreader for faster heat dissipation and cooler operation.",
            "Available in multiple colors to match your system's aesthetic."
        ],
        "rating": 4,
        "merchant": "Uma Hackit",
        "available": 5
    },
    {
        "id": 3,
        "name": "G.SKILL Trident Z5 RGB Series (Intel XMP 3.0) DDR5 RAM 64GB (2x32GB) 6400MT/s CL32-39-39-102 1.40V Desktop Computer Memory UDIMM - Matte Black (F5-6400J3239G32GX2-TZ5RK)",
        "title": "G.SKILL Trident Z5 RGB Series DDR5 RAM 64GB",
        "brand": "G.SKILL",
        "price": 88.3,
        "imageUrl": "http://localhost:3000/images/3.jpg",
        "category": "RAM",
        "descriptions": [
            "Trident Z5 RGB Series, designed for Intel 700/800 Series Chipset with 13th/14th Gen Intel Core Series CPU or Intel Core Ultra 200 Series CPU",
            "Brand: G.Skill, Series: Trident Z5 RGB, Model: F5-6400J3239G32GX2-TZ5RK",
            "64GB kit containing 2 x 32GB modules, DDR5-6400, 288-Pin, CAS Latency CL32 (32-39-39-102) at 1.40V (Intel XMP)",
            "ECC: No, Dual Channel Kit, Recommended Use: High Performance or Gaming Memory",
            "Memory kits will boot at the SPD speed at default BIOS settings with compatible hardware.",
            "For memory kits with XMP, enable XMP profile in BIOS to reach the rated potential XMP overclock speed of the memory kit, subject to the use of compatible hardware.",
            "Reaching the rated XMP overclock speed and system stability will depend on the compatibility and capability of the motherboard and CPU used.",
            "Do not mix memory kits. Memory kits are sold in matched kits that are designed to run together as a set. Mixing memory kits will result in stability issues or system failure."
        ],
        "rating": 5,
        "merchant": "Bob's Code Cave",
        "available": 5
    },
    {
        "id": 4,
        "name": "MSI MAG B760 Tomahawk WiFi Gaming Motherboard (Supports 12th/13th/14th Gen Intel Processors, LGA 1700, DDR5, PCIe 5.0, M.2, 2.5Gbps LAN, USB 3.2 Gen2, HDMI/DP, Wi-Fi 6E, Bluetooth 5.3, ATX)",
        "title": "MSI MAG B760 Tomahawk WiFi Gaming Motherboard",
        "brand": "MSI",
        "price": 67.90,
        "imageUrl": "http://localhost:3000/images/4.jpg",
        "category": "Motherboard",
        "descriptions": [
            "Supports 12th/13th Gen Intel Core, Pentium Gold and Celeron processors for LGA 1700 socket",
            "Supports DDR5 Memory, up to 7000+(OC) MHz",
            "Enhanced Power Design: 12+1+1 Duet Rail Power System, dual 8-pin CPU power connectors, Core Boost, Memory Boost",
            "Lightning Fast Game experience: PCIe 5.0 slot, Lightning Gen 4 x4 M.2, USB 3.2 Gen 2x2",
            "Premium Thermal Solution: Extended Heatsink Design and M.2 Shield Frozr are built for high performance system and non-stop works"
        ],
        "rating": 5,
        "merchant": "Uma Hackit",
        "available": 5
    },
    {
        "id": 5,
        "name": "ASUS TUF Gaming GeForce RTX ™ 5070 12GB GDDR7 OC Edition Gaming Graphics Card (PCIe® 5.0, HDMI®/DP 2.1, 3.125-slot, Military-Grade Components, Protective PCB Coating, axial-tech Fans)",
        "title": "ASUS TUF Gaming GeForce RTX 5070 12GB GDDR7 OC Edition",
        "brand": "ASUS",
        "price": 229.10,
        "imageUrl": "http://localhost:3000/images/5.jpg",
        "category": "GPU",
        "descriptions": [
            "Powered by the NVIDIA Blackwell architecture and DLSS 4",
            "Military-grade components deliver rock-solid power and longer lifespan for ultimate durability",
            "Protective PCB coating helps protect against short circuits caused by moisture, dust, or debris",
            "3.125-slot design with massive fin array optimized for airflow from three Axial-tech fans",
            "Phase-change GPU thermal pad helps ensure optimal thermal performance and longevity, outlasting traditional thermal paste for graphics cards under heavy loads",
            "ASUS GPU Guard and bracket secure the GPU, reducing the risk of cracks and ensuring stable mounting",
            "Auto-Extreme precision automated manufacturing helps ensure higher reliability",
            "GPU Tweak III software provides intuitive performance tweaking, advanced thermal controls, and system monitoring"
        ],
        "rating": 3,
        "merchant": "Dan F",
        "available": 5
    },
    {
        "id": 6,
        "name": "GIGABYTE X870 Eagle WIFI7 AMD AM5 LGA 1718 Motherboard, ATX, DDR5, 4X M.2, PCIe 5.0, USB4, WIFI7, 2.5GbE LAN, EZ-Latch",
        "title": "GIGABYTE X870 Eagle WIFI7 AMD AM5 Motherboard",
        "brand": "GIGABYTE",
        "price": 37.30,
        "imageUrl": "http://localhost:3000/images/6.jpg",
        "category": "Motherboard",
        "descriptions": [
            "AMD Socket AM5: Supports AMD Ryzen 9000 / Ryzen 8000 / Ryzen 7000 Series Processors",
            "DDR5 Compatible: 4*DIMMs with AMD EXPO Support",
            "Power Design: 14+2+2",
            "Thermals: VRM and M.2 Thermal Guard",
            "Connectivity: PCIe 5.0, 3x M.2 Slots, Dual USB4, Front and Rear USB-C"
        ],
        "rating": 5,
        "merchant": "Dan F",
        "available": 5
    },
    {
        "id": 7,
        "name": "PNY T1000 Professional Graphics Card 8GB DDR6 896 Cores 4 miniDP Low Profile (Bracket Included) OEM (Brown Box)",
        "title": "PNY T1000 Graphics Card 8GB DDR6",
        "brand": "PNY",
        "price": 93.33,
        "imageUrl": "http://localhost:3000/images/7.jpg",
        "category": "GPU",
        "descriptions": [
            "PNY VCNT1000-8GB-PB. Graphics processor family",
            "NVIDIA, Graphics processor: T1000",
            "Discrete graphics card memory: 8 GB, Graphics card memory type: GDDR6",
            "Memory bus: 128 bit. Maximum resolution: 7680 x 4320 pixels",
            "DirectX version: 12.0, OpenGL version: 4.5",
            "Interface type: PCI Express x16 3.0",
            "Cooling type: Active, Number of fans: 1 fan(s)"
        ],
        "rating": 2,
        "merchant": "Fyoder's Dust",
        "available": 23
    },
    {
        "id": 8,
        "name": "Acer Predator Vesta II RGB DDR5 RAM 32GB (16GBx2) 6000MHz CL30 PC5-48000, Intel XMP 3.0 AMD Expo Compatible Computer Memory PC5-48000, Black - BL.9BWWR.327",
        "title": "Acer Predator Vest II RGB DDR5 32GB",
        "brand": "Acer",
        "price": 77.8,
        "imageUrl": "http://localhost:3000/images/8.jpg",
        "category": "RAM",
        "descriptions": [
            "High speed & Low latency: Predator Vesta II RGB memory is built with high-quality, hand-screened DDR5 ICs to deliver next-level speeds up to 7200 MHz, unleashing new potential for enthusiasts.",
            "Newest DDR Platform: By doubling the banks and the burst length--and by featuring two independent 32-bit subchannels,-- DDR5 enables faster rendering, processing, buffering than ever to satisfy the growing demands.",
            "Stylish Metallic Heat Sink: Predator DDR5 Vesta II offers a metallic heat sink made of aluminum alloy for enhanced heat dissipation and stable performance. Provides silver and black versions, Predator Vesta II gives you the chance to create your own style.",
            "Supporting Intel XMP 3.0 and AMD EXPO: XMP 3.0 enables factory pre-set profiles, provides users with more options for overclocking, and allows customizable user-defined profiles to be saved in the memory module via BIOS on supported motherboards. It is also compatible with the latest Intel and AMD DDR5 platforms.",
            "Programmable RGB Lighting: Designed with a more streamlined light bar, the Predator Vesta II RGB looks sleeker and brighter than ever. It is compatible with mainstream motherboard software from ASUS, Gigabyte, ASRock and MSI. Our customizable RGB lighting lets you choose from a palette of 16.8 million colors."
        ],
        "rating": 3,
        "merchant": "Bob's Code Cave",
        "available": 9
    },
    {
        "id": 9,
        "name": "ASUS ROG Strix B650-A Gaming WiFi 6E AM5 (LGA1718) Ryzen 7000 Motherboard(12+2 Power Stages,DDR5,3xM.2 Slots,PCIe® 4.0, 2.5G LAN,WiFi 6E,USB 3.2 Gen 2x2 Type-C® Port)",
        "title": "ASUS ROG Strix B650-A AMD Ryzen 7 Motherboard",
        "brand": "ASUS",
        "price": 74.3,
        "imageUrl": "http://localhost:3000/images/9.jpg",
        "category": "Motherboard",
        "descriptions": [
            "AM5 Socket: Ready for AMD Ryzen Desktop 9000*, 8000*, and 7000 Series Processors",
            "*BIOS Update maybe required when used with AMD Ryzen Desktop 9000 and 8000 Series CPU Processors",
            "Robust Power Solution: 12 + 2 power stages with 8 + 4 pin ProCool power connectors, high-quality alloy chokes, and durable capacitors to support multi-core processors",
            "Optimized Thermal Design: Massive VRM heatsinks with strategically cut airflow channels and high conductivity thermal pads",
            "Next-Gen M.2 Support: One PCIe 5.0 M.2 slot and two PCIe 4.0 M.2 slots, all with heatsinks to maximize performance"
        ],
        "rating": 1,
        "merchant": "Uma Hackit",
        "available": 65
    },
    {
        "id": 10,
        "name": "GAMEMAX 1300W Power Supply, ATX 3.0 & PCIE 5.0 Ready, 80+ Platinum Certified, Addressable RGB with 5V Motherboard Sync, 100% Japanese Capacitors, Fully Modular, RGB-1300",
        "title": "GAMEMAX 1300W Power Supply ATX 3.0 & PCIE 5.0 Ready",
        "brand": "GAMEMAX",
        "price": 49.1,
        "imageUrl": "http://localhost:3000/images/10.jpg",
        "category": "PSU",
        "descriptions": [
            "80 Plus Platinum Certified: Fully Power supply 1300W with 80 Plus platinum certified, with 92% or higher efficiency under typical loads.",
            "Stable & Safe Output: DC-DC structure, Full Bridge LLC resonance assist, 12V synchronous rectification provide stable & safe output.",
            "ATX 3.0 & PCIe 5.0 Ready: Comes with a 12VHPWR 16pin connector to provide up to 600W for power hungry Graphics card. The power supply can sustain up to 2x total power excursion and 3x GPU power excursion, fully ready for allfuture high performing components.",
            "Fully modular: Fully modular with all black flat cables, improve airflow and strengthen cable management.",
            "Smart ARGB & Aura Sync: 25 smart lighting modes with Aura Sync compatibility & RGB memory function, adjust lighting effects and synchronise with other compatible hardware."
        ],
        "rating": 4,
        "merchant": "Fyoder's Dust",
        "available": 32
    },
    {
        "id": 11,
        "name": "PCCOOLER CPS YS1200 Power Supply, 1200W 80 Plus Gold Certified Fully Modular PCIe 5.1 & ATX 3.1 Gaming PSU, Wide Compatibility, 135mm FDB Fan, Full Japan Electrolytic Capacitors - 12 Year Warranty",
        "title": "PCCOOLER CPS YS1200 Power Supply 1200W",
        "brand": "PCCOOLER",
        "price": 109.2,
        "imageUrl": "http://localhost:3000/images/11.jpg",
        "category": "PSU",
        "descriptions": [
            "【80 Plus Gold Certified】 Passed 80 PLUS and Cybenetics gold certification, the conversion efficiency exceeds 91% under typical load conditions, ensuring optimal power utilization and reduced energy consumption.【Notice】Please don't use the other brand cables, only use the cables come with PCCOOLER CPS PSU package.",
            "【Fully Modular】 The fully modular power supply allows use of only the cables you need for reduced system clutter and improved air flow.",
            "【135mm FDB FAN】 Use Fluid Dynamic Bearing (FDB) Fan to effectively reduce wear and bring long-lasting stability, taking into account outstanding heat dissipation performance and low noise performance. Supports Zero RPM Fan Mode, the fan stops at low temperature and light load.",
            "【Intel ATX 3.1 Specification Compliant】 Designed to meet Intel ATX 3.1 specifications, our power supply features native PCIe 5.1 power connectors. Capable of handling peak power up to 2 times the total system power and 3 times the GPU power, it effortlessly meets the demands of dynamic overload performance, ensuring enhanced safety and stability.",
            "【Efficient and Reliable Design】 Featuring Active PFC, Full-Bridge LLC Resonant Converter, Synchronous Rectification, and full Japanese 105°C electrolytic capacitors, our power supply delivers superior energy efficiency and stability, perfect for high-power graphics cards."
        ],
        "rating": 3,
        "merchant": "Uma Hackit",
        "available": 3
    }
]